app/views/pessoas/_form.html.erb

SELECT "estados".* FROM "estados"
---
        <%= form.label :estado %>
          <%= collection_select(:pessoa, :estado_id,Estado.all, :id, :nome)%>