app/controllers/estados_controller.rb

  def index
    @estados = Estado.all
---
SELECT "estados".* FROM "estados"

  def create
    @estado = Estado.new(estado_params)

    respond_to do |format|
      if @estado.save
---
INSERT INTO "estados" ("nome", "created_at", "updated_at") VALUES (?, ?, ?)  [["nome", "Pernambuco"], ["created_at", "2023-05-19 16:03:55.424718"], ["updated_at", "2023-05-19 16:03:55.424718"]]

    def set_estado
      @estado = Estado.find(params[:id])
---
SELECT "estados".* FROM "estados" WHERE "estados"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]