app/controllers/pessoas_controller.rb

  def index
    @pessoas = Pessoa.all
---
SELECT "pessoas".* FROM "pessoas"

  def create
    @pessoa = Pessoa.new(pessoa_params)

    respond_to do |format|
      if @pessoa.save
---
INSERT INTO "pessoas" ("nome", "created_at", "updated_at", "estado_id") VALUES (?, ?, ?, ?)  [["nome", "Laiz"], ["created_at", "2023-05-19 16:04:08.484581"], ["updated_at", "2023-05-19 16:04:08.484581"], ["estado_id", 1]]

    def set_pessoa
      @pessoa = Pessoa.find(params[:id])
---
SELECT "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]